status/2021/15oct21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>09 October 2021 - 15 October 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">09 October 2021 - 15 October 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0926f34">1. MIT OCW</a>
<ul>
<li><a href="#orgd2b3a00">1.1. 18.01 - Single Variable Calculus</a>
<ul>
<li><a href="#org2a519d6">1.1.1. Sessions 36-40</a></li>
</ul>
</li>
<li><a href="#org663f3da">1.2. 8.01 - Physics I - Classical Mechanics</a>
<ul>
<li><a href="#org8d377b6">1.2.1. Sessions 20-22</a></li>
<li><a href="#org03e22ea">1.2.2. Labs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org18d1c24">2. Halloween String of Lights</a></li>
<li><a href="#org573a87e">3. Marble Computation</a>
<ul>
<li><a href="#org15141a5">3.1. Next Steps</a>
<ul>
<li><a href="#org05dd50d">3.1.1. Continue Reversible Computation Study</a></li>
<li><a href="#org05d23ba">3.1.2. Prototype Marble inverter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8e095ff">4. ca-r</a>
<ul>
<li><a href="#orgf327625">4.1. Next Step</a></li>
</ul>
</li>
<li><a href="#orgb0cea6e">5. us-index-map</a>
<ul>
<li><a href="#org2c0b3df">5.1. error analysis</a></li>
</ul>
</li>
<li><a href="#org693f3ac">6. Sun Ultra 10</a>
<ul>
<li><a href="#orgc0b3d2b">6.1. Next steps</a>
<ul>
<li><a href="#org98ba236">6.1.1. Serial debug</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7615002">7. Apple iMac G4</a>
<ul>
<li><a href="#orgfe9a143">7.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org8c430ce">8. Davies Brothel</a></li>
<li><a href="#orgabdf9c5">9. Linux Audio</a>
<ul>
<li><a href="#org03b0de6">9.1. pvanal to spectrogram</a>
<ul>
<li><a href="#orgc0b2858">9.1.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orgcccb5ec">9.2. CSound programming.</a>
<ul>
<li><a href="#orgd88ccc1">9.2.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#org9827f6b">9.3. Faust programming</a>
<ul>
<li><a href="#org7b04b7d">9.3.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga7e6b16">10. EPICS</a>
<ul>
<li><a href="#org5747e48">10.1. Next steps</a>
<ul>
<li><a href="#org517bcbd">10.1.1. Started CGR-101 SCPI interface</a></li>
<li><a href="#org7383165">10.1.2. u3scpi network port testing</a></li>
<li><a href="#org0a01b3e">10.1.3. initial EPICS interface</a></li>
<li><a href="#org309b869">10.1.4. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge77cd25">11. Brini Tracker II</a>
<ul>
<li><a href="#org1d9171a">11.1. Next steps</a>
<ul>
<li><a href="#orgc7a1275">11.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#org328e6fb">11.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org119bcbe">11.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc6ca55f">12. wktcolor</a>
<ul>
<li><a href="#orgb5eed1d">12.1. Next steps</a>
<ul>
<li><a href="#org7bbf19a">12.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge6f682c">13. wktplot</a>
<ul>
<li><a href="#org5bba71e">13.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orgfb6fb4a">14. AMDGPU</a>
<ul>
<li><a href="#orga15707a">14.1. Next step</a>
<ul>
<li><a href="#org0faade5">14.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgea830cd">15. Ninja v Make</a>
<ul>
<li><a href="#org67c46f9">15.1. Next Step</a>
<ul>
<li><a href="#org387e6f3">15.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0c75ab6">16. GMP Forth</a>
<ul>
<li><a href="#org8c7f5e5">16.1. Need to think about adding floating point support</a></li>
<li><a href="#orgfd6d168">16.2. Port to non-Linux OS</a></li>
</ul>
</li>
<li><a href="#orga0d675e">17. Swocer</a>
<ul>
<li><a href="#orgaa77dae">17.1. Most crashing addressed</a></li>
<li><a href="#orgeda5e0f">17.2. Added outline for 'bottle' test</a></li>
<li><a href="#orga0adc49">17.3. Next steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Still Praying for Rain
</p>

<div id="outline-container-org0926f34" class="outline-2">
<h2 id="org0926f34"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd2b3a00" class="outline-3">
<h3 id="orgd2b3a00"><span class="section-number-3">1.1.</span> 18.01 - Single Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org2a519d6" class="outline-4">
<h4 id="org2a519d6"><span class="section-number-4">1.1.1.</span> Sessions 36-40</h4>
</div>
</div>
<div id="outline-container-org663f3da" class="outline-3">
<h3 id="org663f3da"><span class="section-number-3">1.2.</span> 8.01 - Physics I - Classical Mechanics</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org8d377b6" class="outline-4">
<h4 id="org8d377b6"><span class="section-number-4">1.2.1.</span> Sessions 20-22</h4>
</div>
<div id="outline-container-org03e22ea" class="outline-4">
<h4 id="org03e22ea"><span class="section-number-4">1.2.2.</span> Labs</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
There's a version of the course (8.01x) that has labs. Gathering
materials Needed for such.
</p>
</div>
<ol class="org-ol">
<li><a id="orgcc34fbb"></a>Lab Power Supply<br />
<div class="outline-text-5" id="text-1-2-2-1">
<p>
One of the lab items needed is a power supply. Why is it that with all
the piles of electronic parts I have, I can't seem to locate an LM317?
Playing around with a design for a mixed switcher and linear supply.
Actually 2 switchers: 24V/2A switcher -&gt; Programmable Buck Switcher -&gt; Programmable Linear.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org18d1c24" class="outline-2">
<h2 id="org18d1c24"><span class="section-number-2">2.</span> Halloween String of Lights</h2>
<div class="outline-text-2" id="text-2">
<p>
A little light display for Halloween this year. Mostly based on the
Garden Orb, running on a Feather M0. Drives a single light so far.
</p>
</div>
</div>
<div id="outline-container-org573a87e" class="outline-2">
<h2 id="org573a87e"><span class="section-number-2">3.</span> Marble Computation</h2>
<div class="outline-text-2" id="text-3">
<p>
Collected materials (thin copper plate, copper PCB blanks) for prototyping.
</p>
</div>
<div id="outline-container-org15141a5" class="outline-3">
<h3 id="org15141a5"><span class="section-number-3">3.1.</span> Next Steps</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org05dd50d" class="outline-4">
<h4 id="org05dd50d"><span class="section-number-4">3.1.1.</span> Continue Reversible Computation Study</h4>
</div>
<div id="outline-container-org05d23ba" class="outline-4">
<h4 id="org05d23ba"><span class="section-number-4">3.1.2.</span> Prototype Marble inverter</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Using dual rail differential logic (left/,right/1), an inverter
merely switches sides. I think little "kickers" on the side should
be sufficient for a purely mechanical approach.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org8e095ff" class="outline-2">
<h2 id="org8e095ff"><span class="section-number-2">4.</span> ca-r</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://github.com/daniel-kelley/ca-r/issues/29">https://github.com/daniel-kelley/ca-r/issues/29</a>
</p>
</div>
<div id="outline-container-orgf327625" class="outline-3">
<h3 id="orgf327625"><span class="section-number-3">4.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-4-1">
<p>
None.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb0cea6e" class="outline-2">
<h2 id="orgb0cea6e"><span class="section-number-2">5.</span> us-index-map</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org2c0b3df" class="outline-3">
<h3 id="org2c0b3df"><span class="section-number-3">5.1.</span> error analysis</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Started an error analysis on the USGS topomaps<sub>all.csv</sub> index file. Nothing abvious pops up,
and the error reported by Maureen would be impossible to catch anyway.
</p>
</div>
</div>
</div>
<div id="outline-container-org693f3ac" class="outline-2">
<h2 id="org693f3ac"><span class="section-number-2">6.</span> Sun Ultra 10</h2>
<div class="outline-text-2" id="text-6">
<p>
Trying to see what state it is in. Fires up but no video. Need DB25M to
debug over serial port.
</p>
</div>
<div id="outline-container-orgc0b3d2b" class="outline-3">
<h3 id="orgc0b3d2b"><span class="section-number-3">6.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org98ba236" class="outline-4">
<h4 id="org98ba236"><span class="section-number-4">6.1.1.</span> Serial debug</h4>
</div>
</div>
</div>
<div id="outline-container-org7615002" class="outline-2">
<h2 id="org7615002"><span class="section-number-2">7.</span> Apple iMac G4</h2>
<div class="outline-text-2" id="text-7">
<p>
Building userland may be a PITA due to lack of RAM. Build would often
segfault.
</p>
</div>
<div id="outline-container-orgfe9a143" class="outline-3">
<h3 id="orgfe9a143"><span class="section-number-3">7.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Not sure.
</p>
</div>
</div>
</div>

<div id="outline-container-org8c430ce" class="outline-2">
<h2 id="org8c430ce"><span class="section-number-2">8.</span> Davies Brothel</h2>
<div class="outline-text-2" id="text-8">
<p>
Next (plea) hearing: 28 October; Department 37
</p>
</div>
</div>
<div id="outline-container-orgabdf9c5" class="outline-2">
<h2 id="orgabdf9c5"><span class="section-number-2">9.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org03b0de6" class="outline-3">
<h3 id="org03b0de6"><span class="section-number-3">9.1.</span> pvanal to spectrogram</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Enough of libriffr and libpvocf work to start pvoctool
<a href="https://github.com/daniel-kelley/pvoctool">https://github.com/daniel-kelley/pvoctool</a>. Have HDF5 output and
text delimited output for octave. Can import PVOC data to octave
spectrogram for display.
</p>
</div>
<div id="outline-container-orgc0b2858" class="outline-4">
<h4 id="orgc0b2858"><span class="section-number-4">9.1.1.</span> Next steps</h4>
<div class="outline-text-4" id="text-9-1-1">
<p>
Loop analysis
</p>
</div>
</div>
</div>
<div id="outline-container-orgcccb5ec" class="outline-3">
<h3 id="orgcccb5ec"><span class="section-number-3">9.2.</span> CSound programming.</h3>
<div class="outline-text-3" id="text-9-2">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-orgd88ccc1" class="outline-4">
<h4 id="orgd88ccc1"><span class="section-number-4">9.2.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-9-2-1">
</div>
<ol class="org-ol">
<li><a id="orgfbc10e2"></a>loscil demo<br /></li>
<li><a id="org78daf40"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org9827f6b" class="outline-3">
<h3 id="org9827f6b"><span class="section-number-3">9.3.</span> Faust programming</h3>
<div class="outline-text-3" id="text-9-3">
</div>
<div id="outline-container-org7b04b7d" class="outline-4">
<h4 id="org7b04b7d"><span class="section-number-4">9.3.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-9-3-1">
</div>
<ol class="org-ol">
<li><a id="orgc10b713"></a>GAC Patch save/restore<br /></li>
<li><a id="org6cedb2f"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-9-3-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="orgfe6a241"></a>OSC control surface<br />
<div class="outline-text-5" id="text-9-3-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="org012cab5"></a>Faust/csound<br />
<div class="outline-text-5" id="text-9-3-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orga7e6b16" class="outline-2">
<h2 id="orga7e6b16"><span class="section-number-2">10.</span> EPICS</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org5747e48" class="outline-3">
<h3 id="org5747e48"><span class="section-number-3">10.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-org517bcbd" class="outline-4">
<h4 id="org517bcbd"><span class="section-number-4">10.1.1.</span> Started CGR-101 SCPI interface</h4>
<div class="outline-text-4" id="text-10-1-1">
</div>
<ol class="org-ol">
<li><a id="org73dbcdc"></a>Will help test u3scpi<br /></li>
<li><a id="org5f4a9de"></a>Using flex/bison SCPI parser<br />
<div class="outline-text-5" id="text-10-1-1-2">
<p>
libscpi has difficulties with SCPI binary transfer, and can be used
to compare two different implementations.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org7383165" class="outline-4">
<h4 id="org7383165"><span class="section-number-4">10.1.2.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org0a01b3e" class="outline-4">
<h4 id="org0a01b3e"><span class="section-number-4">10.1.3.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org309b869" class="outline-4">
<h4 id="org309b869"><span class="section-number-4">10.1.4.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-orge77cd25" class="outline-2">
<h2 id="orge77cd25"><span class="section-number-2">11.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-11">
<p>
Suspended for now.
</p>
</div>
<div id="outline-container-org1d9171a" class="outline-3">
<h3 id="org1d9171a"><span class="section-number-3">11.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-11-1">
</div>
<div id="outline-container-orgc7a1275" class="outline-4">
<h4 id="orgc7a1275"><span class="section-number-4">11.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-org328e6fb" class="outline-4">
<h4 id="org328e6fb"><span class="section-number-4">11.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org119bcbe" class="outline-4">
<h4 id="org119bcbe"><span class="section-number-4">11.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-orgc6ca55f" class="outline-2">
<h2 id="orgc6ca55f"><span class="section-number-2">12.</span> wktcolor</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orgb5eed1d" class="outline-3">
<h3 id="orgb5eed1d"><span class="section-number-3">12.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-12-1">
</div>
<div id="outline-container-org7bbf19a" class="outline-4">
<h4 id="org7bbf19a"><span class="section-number-4">12.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-12-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orge6f682c" class="outline-2">
<h2 id="orge6f682c"><span class="section-number-2">13.</span> wktplot</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org5bba71e" class="outline-3">
<h3 id="org5bba71e"><span class="section-number-3">13.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-orgfb6fb4a" class="outline-2">
<h2 id="orgfb6fb4a"><span class="section-number-2">14.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-orga15707a" class="outline-3">
<h3 id="orga15707a"><span class="section-number-3">14.1.</span> Next step</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<div id="outline-container-org0faade5" class="outline-4">
<h4 id="org0faade5"><span class="section-number-4">14.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-orgea830cd" class="outline-2">
<h2 id="orgea830cd"><span class="section-number-2">15.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org67c46f9" class="outline-3">
<h3 id="org67c46f9"><span class="section-number-3">15.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-15-1">
</div>
<div id="outline-container-org387e6f3" class="outline-4">
<h4 id="org387e6f3"><span class="section-number-4">15.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-org0c75ab6" class="outline-2">
<h2 id="org0c75ab6"><span class="section-number-2">16.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-org8c7f5e5" class="outline-3">
<h3 id="org8c7f5e5"><span class="section-number-3">16.1.</span> Need to think about adding floating point support</h3>
</div>
<div id="outline-container-orgfd6d168" class="outline-3">
<h3 id="orgfd6d168"><span class="section-number-3">16.2.</span> Port to non-Linux OS</h3>
</div>
</div>
<div id="outline-container-orga0d675e" class="outline-2">
<h2 id="orga0d675e"><span class="section-number-2">17.</span> Swocer</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orgaa77dae" class="outline-3">
<h3 id="orgaa77dae"><span class="section-number-3">17.1.</span> Most crashing addressed</h3>
<div class="outline-text-3" id="text-17-1">
<p>
Nullified 'handle' API free functions helped a lot.
Still see some errors in operations.
</p>
</div>
</div>
<div id="outline-container-orgeda5e0f" class="outline-3">
<h3 id="orgeda5e0f"><span class="section-number-3">17.2.</span> Added outline for 'bottle' test</h3>
<div class="outline-text-3" id="text-17-2">
<p>
Added all functions believed to be needed for 'bottle' demo test.
Test doesn't pass so is disabled.
</p>
</div>
</div>
<div id="outline-container-orga0adc49" class="outline-3">
<h3 id="orga0adc49"><span class="section-number-3">17.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-17-3">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
